[
    {
        "category": "regional",
        "title": "PM Svamitva Yojana Empowers Rural Andhra Pradesh with Legal Land Ownership",
        "source": "Times of India",
        "date": "2025-09-30",
        "summary": "The PM Svamitva Yojana is providing legal property rights to villagers in Andhra Pradesh using advanced drone technology, helping to resolve disputes and unlock financial opportunities for rural families.",
        "image": "https://placehold.co/600x400/a7f3d0/14532d?text=AP+Land+Rights"
    },
    {
        "category": "regional",
        "title": "Punjab Farm Groups Demand Cash Incentives Amid Stubble-Burning Crackdown",
        "source": "Times of India",
        "date": "2025-09-29",
        "summary": "As authorities intensify actions against stubble burning, farmer unions in Punjab are protesting and demanding the government provide cash incentives to help them manage crop residue sustainably.",
        "image": "https://placehold.co/600x400/f97316/ffffff?text=Punjab+Protest"
    },
    {
        "category": "national",
        "title": "Govt Promises Aid to Maharashtra Farmers Before Diwali After 'Biggest Calamity in 50 Years'",
        "source": "Times of India",
        "date": "2025-09-30",
        "summary": "Following devastating crop losses from heavy rains, the Maharashtra government has assured over 5 million farmers of financial assistance before Diwali, calling it the worst agricultural disaster in five decades.",
        "image": "https://placehold.co/600x400/22c55e/ffffff?text=Maha+Govt+Aid"
    },
    {
        "category": "national",
        "title": "National Mission on Natural Farming Aims to Enroll 1 Crore Farmers",
        "source": "PIB",
        "date": "2025-08-13",
        "summary": "The Union Cabinet's National Mission on Natural Farming (NMNF) is set to promote chemical-free agriculture across 7.5 lakh hectares, with an outlay of ₹2,481 crore to support farmers in adopting sustainable practices.",
        "image": "https://placehold.co/600x400/38bdf8/ffffff?text=National+Mission"
    },
    {
        "category": "international",
        "title": "World Food India 2025 Wraps Up, Securing Over ₹1 Lakh Crore in Investments",
        "source": "ANI News",
        "date": "2025-09-29",
        "summary": "The World Food India 2025 event concluded successfully, attracting unprecedented investment commitments and strengthening India's position as a global hub for food processing and agri-food value chains.",
        "image": "https://placehold.co/600x400/8b5cf6/ffffff?text=World+Food+India"
    },
    {
        "category": "international",
        "title": "GEF's Food Securities Fund Scales Success in Sustainable Agriculture Globally",
        "source": "GEF",
        "date": "2025-09-29",
        "summary": "The Global Environment Facility's Food Securities Fund is successfully unlocking financing for sustainable agriculture in developing markets, improving smallholder farmer livelihoods and promoting climate-resilient supply chains.",
        "image": "https://placehold.co/600x400/ec4899/ffffff?text=Global+Finance"
    }
]
